# 🍺 Homebrew Bundle — DevOps/SRE Environment

# --- Taps ---
tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"
tap "steipete/tap"

# --- Formulae (CLI Tools) ---
brew "awscli"
brew "bash"
brew "bat"
brew "colima"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "git"
brew "git-delta"
brew "golang-migrate"
brew "gping"
brew "imagemagick"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "mysql-client"
brew "node"
brew "node@22"
brew "oath-toolkit"
brew "openjdk@17"
brew "pipx"
brew "poppler"
brew "postgresql@15"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "starship"
brew "vhs"
brew "xcodegen"
brew "yamllint"
brew "yazi"
brew "zbar"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Casks (GUI Apps) ---
cask "android-commandlinetools"
cask "appcleaner"
cask "betterdisplay"
cask "bitwarden"
cask "cloudflare-warp"
cask "dbeaver-community"
cask "discord"
cask "find-my-ports"
cask "google-chat"
cask "headlamp"
cask "hiddenbar"
cask "insomnia"
cask "itsycal"
cask "keepingyouawake"
cask "libreoffice"
cask "macupdater"
cask "orbstack"
cask "pritunl"
cask "raycast"
cask "rectangle"
cask "redis-insight"
cask "shottr"
cask "slack"
cask "sourcetree"
cask "stats"
cask "telegram"
cask "wezterm"
cask "whatsapp"

# --- Fonts ---
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"

# --- Specialized Tools ---
cask "steipete/tap/codexbar"
